import type {Processor} from "../../types/pcComponents/processor.types";


export const processors: Processor[] = [
    {
        id: 1,
        componentName: "Intel Core i5 10400",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=120N2TinMMBYF0zHIeGEicX-YxBAFPQc2",
            "https://drive.google.com/uc?id=19qkPYXHXF-AKfIdKfyZb_Nd64wuy-88N",
            "https://drive.google.com/uc?id=1faODtHGp7miXalUSRy-63I5lmY08c0dC",

        ],
        price: 102,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 2.9,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 12
        },
        description: "Новий процесор Intel Core i5-10400 10-го покоління, з кодовою назвою мікроархітектури Comet Lake. " +
            "Призначений для настільної платформи Intel LGA 1200. Належить до сімейства високопродуктивних процесорів Core i5.\n" +
            "\n" +
            "Intel Core i5-10400 виробляється за стандартом 14-нм техпроцесу, має 6 ядер, які працюють у 12 потоків зі штатною " +
            "тактовою частотою 2.9 ГГц, 4.0 ГГц у режимі Turbo Boost. Місткість кеш-пам'яті 3-го рівня дорівнює 12 МБ. " +
            "Має 2-канальний контролер пам'яті DDR4.",
        isExist: true
    },
    {
        id: 2,
        componentName: "Intel Pentium Gold G6400",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=15TIbzCkaDM4vvXKgS1cFSl7WNLMuR28Z",
            "https://drive.google.com/uc?id=1R_rKdyjJzNyRWkQWyu_FrZYubKafEoMz",
            "https://drive.google.com/uc?id=1iARr1DccUA_ra2NgOHK-gv7ETpDtF3JJ",
        ],
        price: 88,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 4.0,
            numberOfCores: "2cores",
            numberOfThreads: "4threads",
            l3cacheMB: 4
        },
        description: "Процесор Intel Pentium Gold 10-го покоління, з кодовою назвою мікроархітектури Comet Lake. " +
            "Платформа нового покоління Intel Pentium Gold пропонує продуктивність, необхідну в повсякденних обчисленнях, " +
            "і новітні можливості, як-от сенсорне введення і технологія Intel Ready Mode, що забезпечують «постійну " +
            "готовність ПК до роботи».\n" +
            "\n" +
            "Чудова продуктивність ПК надасть змогу без проблем використовувати багатозадачність, щоб спілкуватися " +
            "з друзями та близькими, розважатися і працювати. Отримайте дивовижну продуктивність і якість графіки, " +
            "яких ви звично чекаєте від процесорів Intel Pentium.\n" +
            "\n" +
            "Призначений для настільної платформи Intel LGA 1200, виготовляється за стандартом 14-нм техпроцесу, " +
            "має 2 ядра, які працюють у 4 потоки на штатній тактовій частоті 4 ГГц. Обсяг кеш-пам'яті 3-го рівня дорівнює 4 МБ. " +
            "Має 2-канальний контролер пам'яті.",
        isExist: true
    },
    {
        id: 3,
        componentName: "Intel Core i5 11400F",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=1z9mS5M-Hj4DmgVtm776p54XBW0yrVpLL",
            "https://drive.google.com/uc?id=1bgSbYKa1wQ59wBzKTKLs7Zrw-YcfpjjT",
            "https://drive.google.com/uc?id=1sleBwbkEJeA48hIHFzbwhWGVlque6A-H",

        ],
        price: 124,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 2.6,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 12
        },
        description: "Процесор Intel - продукт преміум-класу\n" +
            "Щоб ваш комп'ютер працював ефективно та продуктивно, варто оснастити його високотехнологічним процесором Intel. " +
            "Його обчислювальна потужність зробить роботу на цьому пристрої легкою та приємною. Усі програми запускаються плавно, " +
            "а в іграх ви не відчуєте жодних затримок. Все це завдяки ідеальним технічним параметрам процесора, який виводить роботу " +
            "та розваги на дійсно високий рівень.\n" +
            "\n" +
            "Процесор Intel i5-11400F - одне з найцікавіших рішень серед пристроїв такого типу. Відмінності між ним і старшою моделлю " +
            "добре помітні. Вже в самому дизайні акцент був зроблений на продуктивність і кращі результати роботи. Це модель із " +
            "заблокованим мультиплікатором, тому будь-яке втручання в його параметри неможливе. Втім, це не заважає їй досягати " +
            "тих результатів, які були задані конструкторами.\n" +
            "\n" +
            "Можливості процесора Intel\n" +
            "Чіп процесора Intel i5-11400F виготовлений із застосуванням 14-нм літографічного процесу. Наразі це є стандартом " +
            "на ринку і використовується в аналогічних моделях. Однак нова архітектура ядра Cypress Cove з портом Ice Lake дозволила " +
            "оснастити пристрій 6 робочими ядрами, які працюють на 12 потоків, що забезпечує тактову частоту 2,6 ГГц, а в режимі Boost - до 4,4 ГГц. Такі показники свідчать про високу продуктивність з самого першого запуску обладнання.\n" +
            "\n" +
            "Також на продуктивність процесора впливає використаний незалежний кеш L3 об'ємом 12 МБ. Він трирівневий, що забезпечує " +
            "безперебійне зберігання та обмін тимчасовою інформацією. Він також відповідає за синхронізацію роботи декількох ядер " +
            "процесора. Він опосередковує обмін ідентичними або так чи інакше пов'язаними фрагментами даних у будь-який момент " +
            "часу.\n" +
            "\n" +
            "Технологія майбутнього\n" +
            "За обробку даних в процесорі Intel відповідає технологія Hyper-Threading. Вона була розроблена виробником, щоб " +
            "дозволити двом потокам функціонувати на одному ядрі. Тому багатопотокові додатки можуть виконувати значно більше " +
            "завдань за значно менший час. Створення анімації, гра або обробка фотографій стане для вас легким і приємним завданням, " +
            "без жодних проблем.\n" +
            "\n" +
            "Існує також функція Turbo Boost, яка автоматично підлаштовує тактову частоту процесора відповідно до попиту. У " +
            "будь-який момент часу процесор Intel може досягти свого максимального рівня продуктивності, але коли це не потрібно, " +
            "навантаження буде раціоналізовано, що зробить пристрій більш енергоефективним. Це ідеальний вибір як для професіоналів, " +
            "так і для звичайних користувачів комп'ютерів.\n" +
            "\n" +
            "Винятковий пристрій на борту вашого ПК\n" +
            "Процесор Intel i5-11400F - це чіп з двоканальним контролером пам'яті, який має можливість підтримувати оперативну " +
            "пам'ять DDR4 на частоті до 3200 МГц. Це гарантує значно більшу пропускну здатність і майже вдвічі менше енергоспоживання " +
            "в порівнянні зі старою пам'яттю типу DDR3. Ця модель процесора дозволить вам створити по-справжньому потужний пристрій " +
            "на базі сучасних технологічних стандартів.\n" +
            "\n" +
            "Пристрій оснащений інтерфейсом PCIe 4.0, який має додаткові лінії для підтримки зовнішньої відеокарти, твердотільного" +
            " накопичувача та інших компонентів. Прискорене завантаження ігор і рівнів стає можливим завдяки підтримці пам'яті " +
            "Intel Optane, а технології Thunderbolt 4 і Intel Killer Wi-Fi забезпечують високошвидкісне підключення до Інтернету " +
            "і розширені мережеві функції на сумісних материнських платах. Використання цих рішень гарантує вам роботу на найвищому " +
            "рівні.\n" +
            "\n" +
            "Використання процесора\n" +
            "Процесор Intel i5-11400F забезпечить вам оптимальний баланс тактової частоти та продуктивності ядра. Це важливо в " +
            "іграх, оскільки дозволяє відображати більше кадрів в секунду або підвищити продуктивність. Висока частота кадрів в " +
            "секунду (FPS) і продуктивність - це дві ключові характеристики, на які особливо звертають увагу геймери.\n" +
            "\n" +
            "Процесор Intel i5-11400F використовує роз'єм LGA типу 1200, який зазвичай називають Socket 1200. Цей роз'єм має 49 " +
            "додаткових контактів у порівнянні зі своїм попередником Socket 1151. Вони використовуються для процесів конвертації," +
            " завдяки чому обчислювальна потужність значно збільшується. У випадку з процесорами молодшого покоління додаткові " +
            "контакти виконують функцію джерела живлення.\n" +
            "\n" +
            "При створенні ПК з нуля зверніть увагу на процесор Intel i5-11400F. Це модель, яку варто рекомендувати через її " +
            "продуктивність і неймовірну для заліза такого класу продуктивність. Він ідеально підходить не тільки для ігор і " +
            "фільмів, але й для офісних додатків. Він також ідеально підходить для використання вдома в якості освітнього " +
            "інструменту. Ознайомтеся з відгуками інших користувачів і прийміть правильне рішення вже сьогодні.",
        isExist: true
    },
    {
        id: 4,
        componentName: "Intel Core i7 11700",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=16LQPshQtANt8K5sah-WY7gl8X90akP3i",
            "https://drive.google.com/uc?id=1drZ8ixpj5Kh7dDZRcCFIXTfOwugQ3zi9",
            "https://drive.google.com/uc?id=18c_XQ7KP4eS5TdYI9uuQhRPgXyuI-uNH",
        ],
        price: 132,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 2.5,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 16
        },
        description: "Процесор Intel Core i7-11700\n" +
            "\n" +
            "Intel Core i7-11700 — це потужний 8-ядерний 16-потоковий процесор 11-го покоління лінійки Rocket Lake," +
            " призначений для сокета LGA1200. Базова тактова частота становить 2.5 ГГц, а з технологією Intel Turbo Boost" +
            " вона може динамічно підвищуватися до 4.9 ГГц, забезпечуючи високу продуктивність у найвимогливіших задачах.\n" +
            "\n" +
            "Процесор оснащений 16 МБ кешу третього рівня (L3) та підтримує оперативну пам’ять DDR4 з частотою до 3200 МГц." +
            " Вбудоване графічне ядро Intel UHD Graphics 750 дозволяє працювати без дискретної відеокарти, що є перевагою для " +
            "офісних чи мультимедійних систем.\n" +
            "\n" +
            "Підтримка сучасних інструкцій і технологій, таких як Intel Hyper-Threading, Virtualization, AVX2 та інші, " +
            "робить Core i7-11700 відмінним вибором для збалансованих ігрових, робочих та домашніх ПК.",
        isExist: true
    },
    {
        id: 5,
        componentName: "Intel Core i3 12100F",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=1CetZzL5kE1Re4YhheppQMBTs3QNBudx7",
            "https://drive.google.com/uc?id=1nuEZcCV1GDYmhfbQ7WT1Pm3Pk99KP3LQ",
            "https://drive.google.com/uc?id=1aAicemH00RhYI3e__PhqyJvgaUe3505_",
        ],
        price: 128,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 3.3,
            numberOfCores: "4cores",
            numberOfThreads: "8threads",
            l3cacheMB: 12
        },
        description: "Intel Core i3-12100F (BX8071512100F) – молодший процесор у лінійці 12-покоління рішень " +
            "компанії Intel, які отримали кодову назву Alder Lake. Він демонструє відмінний баланс продуктивності " +
            "та енергоефективності, завдяки чому добре підійде як основа для робочого чи ігрового комп'ютера початкового " +
            "рівня. Intel Core i3-12100F (BX8071512100F) виготовляється на основі тих. процесу Intel 7 та оснащується " +
            "4 ядрами з 8 потоками. Базова тактова частота процесора становить 3,3 ГГц, а режимі максимального" +
            " прискорення здатна підвищуватися до 4,3 ГГц. Об'єм встановленої кеш-пам'яті третього рівня – 12 МБ.",
        isExist: true
    },
    {
        id: 6,
        componentName: "Intel Core i5 12400F",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/MkZZ8Gvy/1.webp",
            "https://i.ibb.co/7twN86yX/3.webp",
            "https://i.ibb.co/1YMmmxtL/2.webp",
        ],
        price: 142,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 2.5,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 18
        },
        description: "Intel Core i5-12400F (BX8071512400F) – процесор середнього рівня в лінійці 12-го " +
            "покоління рішень компанії Intel, під кодовою назвою Alder Lake і на основі техпроцесу Intel 7. " +
            "Він має роз'єм Socket 1700 і добре підійде як основа для ігрового або робочого комп'ютера. " +
            "Індекс F у назві Intel Core i5-12400F (BX8071512400F) означає відсутність вбудованого графічного " +
            "рішення, що дозволяє зменшити нагрівання при максимальному навантаженні, покращити тепловідведення," +
            " а також мати трохи більший потенціал для ручного розгону. Процесор отримав 6 ядер, що працюють " +
            "у 12 потоках. Його базова тактова частота становить 2,5 ГГц, а в режимі Turbo Boost здатна підвищуватися " +
            "до 4,4 ГГц. Об'єм кеш-пам'яті третього рівня становить 18 МБ. Максимальний об'єм оперативної пам'яті " +
            "DDR4 та DDR5, який підтримує Intel Core i5-12400F (BX8071512400F) – 128 ГБ.",
        isExist: true
    },
    {
        id: 7,
        componentName: "Intel Core i5 12400F",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=1CetZzL5kE1Re4YhheppQMBTs3QNBudx7",
            "https://drive.google.com/uc?id=1nuEZcCV1GDYmhfbQ7WT1Pm3Pk99KP3LQ",
            "https://drive.google.com/uc?id=1aAicemH00RhYI3e__PhqyJvgaUe3505_",
        ],
        price: 142,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 2.5,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 18
        },
        description: "Intel Core i5-12400F (BX8071512400F) – процесор середнього рівня в лінійці 12-го " +
            "покоління рішень компанії Intel, під кодовою назвою Alder Lake і на основі техпроцесу Intel 7. " +
            "Він має роз'єм Socket 1700 і добре підійде як основа для ігрового або робочого комп'ютера. " +
            "Індекс F у назві Intel Core i5-12400F (BX8071512400F) означає відсутність вбудованого графічного " +
            "рішення, що дозволяє зменшити нагрівання при максимальному навантаженні, покращити тепловідведення," +
            " а також мати трохи більший потенціал для ручного розгону. Процесор отримав 6 ядер, що працюють " +
            "у 12 потоках. Його базова тактова частота становить 2,5 ГГц, а в режимі Turbo Boost здатна підвищуватися " +
            "до 4,4 ГГц. Об'єм кеш-пам'яті третього рівня становить 18 МБ. Максимальний об'єм оперативної пам'яті " +
            "DDR4 та DDR5, який підтримує Intel Core i5-12400F (BX8071512400F) – 128 ГБ.",
        isExist: true
    }
]


