"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.processors = void 0;
exports.processors = [
    {
        id: 1,
        componentName: "Intel Core i5 10400",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=120N2TinMMBYF0zHIeGEicX-YxBAFPQc2",
            "https://drive.google.com/uc?id=19qkPYXHXF-AKfIdKfyZb_Nd64wuy-88N",
            "https://drive.google.com/uc?id=1faODtHGp7miXalUSRy-63I5lmY08c0dC",
        ],
        price: 102,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 2.9,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 12
        },
        description: "Новий процесор Intel Core i5-10400 10-го покоління, з кодовою назвою мікроархітектури Comet Lake. " +
            "Призначений для настільної платформи Intel LGA 1200. Належить до сімейства високопродуктивних процесорів Core i5.\n" +
            "\n" +
            "Intel Core i5-10400 виробляється за стандартом 14-нм техпроцесу, має 6 ядер, які працюють у 12 потоків зі штатною " +
            "тактовою частотою 2.9 ГГц, 4.0 ГГц у режимі Turbo Boost. Місткість кеш-пам'яті 3-го рівня дорівнює 12 МБ. " +
            "Має 2-канальний контролер пам'яті DDR4.",
        numberOfItems: 20
    },
    {
        id: 2,
        componentName: "Intel Pentium Gold G6400",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=15TIbzCkaDM4vvXKgS1cFSl7WNLMuR28Z",
            "https://drive.google.com/uc?id=1R_rKdyjJzNyRWkQWyu_FrZYubKafEoMz",
            "https://drive.google.com/uc?id=1iARr1DccUA_ra2NgOHK-gv7ETpDtF3JJ",
        ],
        price: 88,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 4.0,
            numberOfCores: "2cores",
            numberOfThreads: "4threads",
            l3cacheMB: 4
        },
        description: "Процесор Intel Pentium Gold 10-го покоління, з кодовою назвою мікроархітектури Comet Lake. " +
            "Платформа нового покоління Intel Pentium Gold пропонує продуктивність, необхідну в повсякденних обчисленнях, " +
            "і новітні можливості, як-от сенсорне введення і технологія Intel Ready Mode, що забезпечують «постійну " +
            "готовність ПК до роботи».\n" +
            "\n" +
            "Чудова продуктивність ПК надасть змогу без проблем використовувати багатозадачність, щоб спілкуватися " +
            "з друзями та близькими, розважатися і працювати. Отримайте дивовижну продуктивність і якість графіки, " +
            "яких ви звично чекаєте від процесорів Intel Pentium.\n" +
            "\n" +
            "Призначений для настільної платформи Intel LGA 1200, виготовляється за стандартом 14-нм техпроцесу, " +
            "має 2 ядра, які працюють у 4 потоки на штатній тактовій частоті 4 ГГц. Обсяг кеш-пам'яті 3-го рівня дорівнює 4 МБ. " +
            "Має 2-канальний контролер пам'яті.",
        numberOfItems: 20
    },
    {
        id: 3,
        componentName: "Intel Core i5 11400F",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=1z9mS5M-Hj4DmgVtm776p54XBW0yrVpLL",
            "https://drive.google.com/uc?id=1bgSbYKa1wQ59wBzKTKLs7Zrw-YcfpjjT",
            "https://drive.google.com/uc?id=1sleBwbkEJeA48hIHFzbwhWGVlque6A-H",
        ],
        price: 124,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 2.6,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 12
        },
        description: "Процесор Intel - продукт преміум-класу\n" +
            "Щоб ваш комп'ютер працював ефективно та продуктивно, варто оснастити його високотехнологічним процесором Intel. " +
            "Його обчислювальна потужність зробить роботу на цьому пристрої легкою та приємною. Усі програми запускаються плавно, " +
            "а в іграх ви не відчуєте жодних затримок. Все це завдяки ідеальним технічним параметрам процесора, який виводить роботу " +
            "та розваги на дійсно високий рівень.\n" +
            "\n" +
            "Процесор Intel i5-11400F - одне з найцікавіших рішень серед пристроїв такого типу. Відмінності між ним і старшою моделлю " +
            "добре помітні. Вже в самому дизайні акцент був зроблений на продуктивність і кращі результати роботи. Це модель із " +
            "заблокованим мультиплікатором, тому будь-яке втручання в його параметри неможливе. Втім, це не заважає їй досягати " +
            "тих результатів, які були задані конструкторами.\n" +
            "\n" +
            "Можливості процесора Intel\n" +
            "Чіп процесора Intel i5-11400F виготовлений із застосуванням 14-нм літографічного процесу. Наразі це є стандартом " +
            "на ринку і використовується в аналогічних моделях. Однак нова архітектура ядра Cypress Cove з портом Ice Lake дозволила " +
            "оснастити пристрій 6 робочими ядрами, які працюють на 12 потоків, що забезпечує тактову частоту 2,6 ГГц, а в режимі Boost - до 4,4 ГГц. Такі показники свідчать про високу продуктивність з самого першого запуску обладнання.\n" +
            "\n" +
            "Також на продуктивність процесора впливає використаний незалежний кеш L3 об'ємом 12 МБ. Він трирівневий, що забезпечує " +
            "безперебійне зберігання та обмін тимчасовою інформацією. Він також відповідає за синхронізацію роботи декількох ядер " +
            "процесора. Він опосередковує обмін ідентичними або так чи інакше пов'язаними фрагментами даних у будь-який момент " +
            "часу.\n" +
            "\n" +
            "Технологія майбутнього\n" +
            "За обробку даних в процесорі Intel відповідає технологія Hyper-Threading. Вона була розроблена виробником, щоб " +
            "дозволити двом потокам функціонувати на одному ядрі. Тому багатопотокові додатки можуть виконувати значно більше " +
            "завдань за значно менший час. Створення анімації, гра або обробка фотографій стане для вас легким і приємним завданням, " +
            "без жодних проблем.\n" +
            "\n" +
            "Існує також функція Turbo Boost, яка автоматично підлаштовує тактову частоту процесора відповідно до попиту. У " +
            "будь-який момент часу процесор Intel може досягти свого максимального рівня продуктивності, але коли це не потрібно, " +
            "навантаження буде раціоналізовано, що зробить пристрій більш енергоефективним. Це ідеальний вибір як для професіоналів, " +
            "так і для звичайних користувачів комп'ютерів.\n" +
            "\n" +
            "Винятковий пристрій на борту вашого ПК\n" +
            "Процесор Intel i5-11400F - це чіп з двоканальним контролером пам'яті, який має можливість підтримувати оперативну " +
            "пам'ять DDR4 на частоті до 3200 МГц. Це гарантує значно більшу пропускну здатність і майже вдвічі менше енергоспоживання " +
            "в порівнянні зі старою пам'яттю типу DDR3. Ця модель процесора дозволить вам створити по-справжньому потужний пристрій " +
            "на базі сучасних технологічних стандартів.\n" +
            "\n" +
            "Пристрій оснащений інтерфейсом PCIe 4.0, який має додаткові лінії для підтримки зовнішньої відеокарти, твердотільного" +
            " накопичувача та інших компонентів. Прискорене завантаження ігор і рівнів стає можливим завдяки підтримці пам'яті " +
            "Intel Optane, а технології Thunderbolt 4 і Intel Killer Wi-Fi забезпечують високошвидкісне підключення до Інтернету " +
            "і розширені мережеві функції на сумісних материнських платах. Використання цих рішень гарантує вам роботу на найвищому " +
            "рівні.\n" +
            "\n" +
            "Використання процесора\n" +
            "Процесор Intel i5-11400F забезпечить вам оптимальний баланс тактової частоти та продуктивності ядра. Це важливо в " +
            "іграх, оскільки дозволяє відображати більше кадрів в секунду або підвищити продуктивність. Висока частота кадрів в " +
            "секунду (FPS) і продуктивність - це дві ключові характеристики, на які особливо звертають увагу геймери.\n" +
            "\n" +
            "Процесор Intel i5-11400F використовує роз'єм LGA типу 1200, який зазвичай називають Socket 1200. Цей роз'єм має 49 " +
            "додаткових контактів у порівнянні зі своїм попередником Socket 1151. Вони використовуються для процесів конвертації," +
            " завдяки чому обчислювальна потужність значно збільшується. У випадку з процесорами молодшого покоління додаткові " +
            "контакти виконують функцію джерела живлення.\n" +
            "\n" +
            "При створенні ПК з нуля зверніть увагу на процесор Intel i5-11400F. Це модель, яку варто рекомендувати через її " +
            "продуктивність і неймовірну для заліза такого класу продуктивність. Він ідеально підходить не тільки для ігор і " +
            "фільмів, але й для офісних додатків. Він також ідеально підходить для використання вдома в якості освітнього " +
            "інструменту. Ознайомтеся з відгуками інших користувачів і прийміть правильне рішення вже сьогодні.",
        numberOfItems: 20
    },
    {
        id: 4,
        componentName: "Intel Core i7 11700",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=16LQPshQtANt8K5sah-WY7gl8X90akP3i",
            "https://drive.google.com/uc?id=1drZ8ixpj5Kh7dDZRcCFIXTfOwugQ3zi9",
            "https://drive.google.com/uc?id=18c_XQ7KP4eS5TdYI9uuQhRPgXyuI-uNH",
        ],
        price: 132,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1200",
            processorFrequencyGHz: 2.5,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 16
        },
        description: "Процесор Intel Core i7-11700\n" +
            "\n" +
            "Intel Core i7-11700 — це потужний 8-ядерний 16-потоковий процесор 11-го покоління лінійки Rocket Lake," +
            " призначений для сокета LGA1200. Базова тактова частота становить 2.5 ГГц, а з технологією Intel Turbo Boost" +
            " вона може динамічно підвищуватися до 4.9 ГГц, забезпечуючи високу продуктивність у найвимогливіших задачах.\n" +
            "\n" +
            "Процесор оснащений 16 МБ кешу третього рівня (L3) та підтримує оперативну пам’ять DDR4 з частотою до 3200 МГц." +
            " Вбудоване графічне ядро Intel UHD Graphics 750 дозволяє працювати без дискретної відеокарти, що є перевагою для " +
            "офісних чи мультимедійних систем.\n" +
            "\n" +
            "Підтримка сучасних інструкцій і технологій, таких як Intel Hyper-Threading, Virtualization, AVX2 та інші, " +
            "робить Core i7-11700 відмінним вибором для збалансованих ігрових, робочих та домашніх ПК.",
        numberOfItems: 20
    },
    {
        id: 5,
        componentName: "Intel Core i3 12100F",
        category: "processors",
        imgUrls: [
            "https://drive.google.com/uc?id=1CetZzL5kE1Re4YhheppQMBTs3QNBudx7",
            "https://drive.google.com/uc?id=1nuEZcCV1GDYmhfbQ7WT1Pm3Pk99KP3LQ",
            "https://drive.google.com/uc?id=1aAicemH00RhYI3e__PhqyJvgaUe3505_",
        ],
        price: 128,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 3.3,
            numberOfCores: "4cores",
            numberOfThreads: "8threads",
            l3cacheMB: 12
        },
        description: "Intel Core i3-12100F (BX8071512100F) – молодший процесор у лінійці 12-покоління рішень " +
            "компанії Intel, які отримали кодову назву Alder Lake. Він демонструє відмінний баланс продуктивності " +
            "та енергоефективності, завдяки чому добре підійде як основа для робочого чи ігрового комп'ютера початкового " +
            "рівня. Intel Core i3-12100F (BX8071512100F) виготовляється на основі тих. процесу Intel 7 та оснащується " +
            "4 ядрами з 8 потоками. Базова тактова частота процесора становить 3,3 ГГц, а режимі максимального" +
            " прискорення здатна підвищуватися до 4,3 ГГц. Об'єм встановленої кеш-пам'яті третього рівня – 12 МБ.",
        numberOfItems: 20
    },
    {
        id: 6,
        componentName: "Intel Core i5 12400F",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/MkZZ8Gvy/1.webp",
            "https://i.ibb.co/7twN86yX/3.webp",
            "https://i.ibb.co/1YMmmxtL/2.webp",
        ],
        price: 142,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 2.5,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 18
        },
        description: "Intel Core i5-12400F (BX8071512400F) – процесор середнього рівня в лінійці 12-го " +
            "покоління рішень компанії Intel, під кодовою назвою Alder Lake і на основі техпроцесу Intel 7. " +
            "Він має роз'єм Socket 1700 і добре підійде як основа для ігрового або робочого комп'ютера. " +
            "Індекс F у назві Intel Core i5-12400F (BX8071512400F) означає відсутність вбудованого графічного " +
            "рішення, що дозволяє зменшити нагрівання при максимальному навантаженні, покращити тепловідведення," +
            " а також мати трохи більший потенціал для ручного розгону. Процесор отримав 6 ядер, що працюють " +
            "у 12 потоках. Його базова тактова частота становить 2,5 ГГц, а в режимі Turbo Boost здатна підвищуватися " +
            "до 4,4 ГГц. Об'єм кеш-пам'яті третього рівня становить 18 МБ. Максимальний об'єм оперативної пам'яті " +
            "DDR4 та DDR5, який підтримує Intel Core i5-12400F (BX8071512400F) – 128 ГБ.",
        numberOfItems: 20
    },
    {
        id: 7,
        componentName: "Intel Core i5 14400F",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/gLXbTs1m/3.webp",
            "https://i.ibb.co/6RppBpkR/2.webp",
            "https://i.ibb.co/HT9Q91qp/1.webp",
        ],
        price: 148,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 2.5,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 20
        },
        description: "Будьте тими, ким хочете бути\n" +
            "У грі та поза нею, завдяки оптимізованій продуктивності та новим функціям, що дозволять вам грати " +
            "більше та працювати швидше. \n" +
            "Гібридна архітектура Cores Performance\n" +
            "Дозволяє процесорам Intel Core надавати пріоритет інтенсивним завданням на P-ядрах, одночасно " +
            "виконуючи фонові завдання на E-ядрах.\n" +
            "\n" +
            "Чим більше потоків, тим більше завдань може виконувати центральний процесор. Ви можете переглядати " +
            "довідники, спілкуватися в чаті та дивитися відео під час гри. \n" + "" +
            "Оперативніше, ніж будь-коли\n" +
            "Підніміть багатозадачність на новий рівень завдяки підтримці найкращих швидкостей передачі даних і новітньому обладнанню:\n" +
            "\n" +
            "Thunderbolt 4\n" +
            "\n" +
            "Завдяки підтримці Thunderbolt 4 ви можете використовувати один кабель для підключення моніторів високої роздільної здатності, зовнішніх накопичувачів або інших периферійних пристроїв - без шкоди для вашої кабельної системи.\n" +
            "\n" +
            "PCIe Gen 5\n" +
            "\n" +
            "Записуйте та створюйте резервні копії ігрового процесу у високій роздільній здатності за допомогою найшвидшого з'єднання компонентів.",
        numberOfItems: 20
    },
    {
        id: 8,
        componentName: "Intel Core i5 14600K",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/xtvbjD2q/3.webp",
            "https://i.ibb.co/VpWNFCLW/2.webp",
            "https://i.ibb.co/k2jztPtx/1.webp",
        ],
        price: 150,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1700",
            processorFrequencyGHz: 2.8,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 22
        },
        description: "Процесор Intel Core i5-14600KF (BX8071514600KF) - це сучасне рішення для тих, хто " +
            "вимагає високої продуктивності в повсякденних завданнях і ресурсоємних додатках. Оснащений 14 ядрами," +
            " з яких 6 високопродуктивних працюють на базовій частоті 3,5 ГГц, з можливістю розгону до 5,3 ГГц, а " +
            "8 енергоефективних ядер мають базову частоту 2,6 ГГц і можуть прискорюватися до 4 ГГц. Така архітектура " +
            "дає змогу ефективно розподіляти навантаження і забезпечувати баланс між продуктивністю та енергоспоживанням. " +
            "Процесор побудований на базі архітектури Raptor Lake Refresh і виконаний за 7-нанометровою технологією " +
            "Intel, що дає йому змогу підтримувати високу обчислювальну потужність за оптимального рівня енергоспоживання. " +
            "Intel Core i5-14600KF (BX8071514600KF) оснащений 20 МБ кеш-пам'яті другого рівня і 24 МБ кеш-пам'яті" +
            " третього рівня, що прискорює доступ до даних і підвищує загальну ефективність системи. Він підтримує до " +
            "20 потоків, що покращує багатозадачність і робить його придатним для складних обчислень і роботи з " +
            "багатозадачними додатками. Процесор підтримує пам'ять DDR5-5600 і DDR4-3200 з максимальним об'ємом до 192 ГБ " +
            "і двома каналами, що забезпечує високу пропускну здатність для роботи з пам'яттю. TDP процесора становить " +
            "125 Вт при стандартних навантаженнях і може досягати 181 Вт при максимальному навантаженні. Додатковою " +
            "перевагою є розблокований множник, який відкриває можливості для розгону і гнучкого налаштування системи. " +
            "Intel Core i5-14600KF (BX8071514600KF) постачається в комплектації Box і сумісний із роз'ємом Socket 1700, " +
            "що робить його відповідним вибором для різних збірок.",
        numberOfItems: 20
    },
    {
        id: 9,
        componentName: "Intel Core i5 8500",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/vxdY8m9x/3.webp",
            "https://i.ibb.co/8gghgFY4/2.webp",
            "https://i.ibb.co/PvGZkVgz/1.webp",
        ],
        price: 122,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1151",
            processorFrequencyGHz: 3.0,
            numberOfCores: "6cores",
            numberOfThreads: "6threads",
            l3cacheMB: 9
        },
        description: "Сімейство Coffee Lake подарувало людству процесор Intel Core i5-8500 (BX80684I58500)" +
            " з частотою 3 ГГц в базовому режимі, а також технологію Turbo Boost, завдяки якій ця базова " +
            "частота може вирости до 4.1 ГГц. Крім того, модель оснастили шістьма ядрами з такою ж кількістю " +
            "потоків, 9 МБ кеш-пам'яті і графічним чіпом Intel UHD 630 з частотою 350 МГц, а літографія " +
            "виконана по 14 нм техпроцесу. Пристрій призначений для установки в сокет 1151-V2, де може " +
            "витримати температуру до 100 ° C при максимальному TDP 65 Вт. З процесором Intel Core i5-8500 (BX80684I58500)" +
            " можна використовувати двоканальну оперативну пам'ять DDR4 з частотою не вище 2666 МГц і об'ємом до " +
            "128 ГБ, в залежності від типу пам'яті.",
        numberOfItems: 20
    },
    {
        id: 10,
        componentName: "Intel Core i5 9600K",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/JRPkqzmX/3.webp",
            "https://i.ibb.co/2Yvtkzg3/2.webp",
            "https://i.ibb.co/YBgFSBSc/1.webp",
        ],
        price: 134,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1151",
            processorFrequencyGHz: 3.7,
            numberOfCores: "6cores",
            numberOfThreads: "6threads",
            l3cacheMB: 9
        },
        description: "Кількість обчислювальних ядер в процесорі Intel Core i5-9600K (BX80684I59600K)" +
            " дорівнює 6 і стільки ж у них потоків. Створений з споживаної потужністю 95 Вт, модель виконана " +
            "по 14 nm техпроцесу під LGA1151 сокет має кеш-пам'ять 9 MB SmartCache. Діапазон частот реалізований " +
            "від 3,70 GHz - базова і до 4,60 GHz в режимі Turbo Boost. Модель офіційно працює з пам'яттю " +
            "DDR4 з максимальними об'ємом і частотою 128 ГБ і 2666 МГц. Також в неї вбудований графічний " +
            "чіп Intel UHD 630 з підтримкою 4K. Процесор Intel Core i5-9600K (BX80684I59600K) сумісний з " +
            "технологіями Intel Quick Sync Video, InTru 3D, Intel Clear Video HD, Intel Turbo Boost 2.0, " +
            "технологією віртуалізації Intel (VT-x), технологією віртуалізації Intel для спрямованого " +
            "введення / виведення (VT- d), Intel SpeedStep і Intel Trusted Execution.",
        numberOfItems: 20
    },
    {
        id: 11,
        componentName: "Intel Core i7 7700K",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/XZrPVRgj/3.webp",
            "https://i.ibb.co/nN8JsR50/2.webp",
            "https://i.ibb.co/XfwYKfXK/1.webp",
        ],
        price: 137,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1151",
            processorFrequencyGHz: 4.2,
            numberOfCores: "4cores",
            numberOfThreads: "8threads",
            l3cacheMB: 8
        },
        description: "Ми гарантуємо доставку товару в строк від 14 до 21 днів, без урахування свят. " +
            "При підвищенні терміну доставки понад 21 день, можливе повернення коштів за запитом покупця.\n" +
            "\n" +
            "Покупець оформлюючи передзамовлення на товар і роблячи передоплату, приймає умови про неможливість " +
            "скасування замовлення та повернення грошей у період доставки. Всі товари нами оформляються у постачальника" +
            " за повною передоплатою та можливість скасування відсутня. Покупець має право повернення чи заміну " +
            "товару у гарантійному випадку через несправність (брак).\n" +
            "\n" +
            "Просимо приймати цю інформацію до уваги при оформленні замовлення.",
        numberOfItems: 20
    },
    {
        id: 12,
        componentName: "Intel Core i7 8700K",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/5gtC3KZV/3.webp",
            "https://i.ibb.co/Mmqm1rK/2.webp",
            "https://i.ibb.co/tM89h5hj/1.webp",
        ],
        price: 143,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1151",
            processorFrequencyGHz: 3.7,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 12
        },
        description: "Ми гарантуємо доставку товару в строк від 14 до 21 днів, без урахування свят. " +
            "При підвищенні терміну доставки понад 21 день, можливе повернення коштів за запитом покупця.\n" +
            "\n" +
            "Покупець оформлюючи передзамовлення на товар і роблячи передоплату, приймає умови про неможливість " +
            "скасування замовлення та повернення грошей у період доставки. Всі товари нами оформляються у постачальника" +
            " за повною передоплатою та можливість скасування відсутня. Покупець має право повернення чи заміну " +
            "товару у гарантійному випадку через несправність (брак).\n" +
            "\n" +
            "Просимо приймати цю інформацію до уваги при оформленні замовлення.",
        numberOfItems: 20
    },
    {
        id: 13,
        componentName: "Intel Core i3 3240",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/3yXdPwFt/3.webp",
            "https://i.ibb.co/BVWkN1sv/2.webp",
            "https://i.ibb.co/JRnYhSf4/1.webp",
        ],
        price: 104,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1155",
            processorFrequencyGHz: 3.4,
            numberOfCores: "2cores",
            numberOfThreads: "2threads",
            l3cacheMB: 3
        },
        description: "Процесор Intel Core i3-3240 3.4GHz/3MB/5GT/s (SR0RH) s1155, tray – ідеальне " +
            "рішення для сучасних ПК\n" +
            "\n" +
            "Процесор Intel Core i3-3240 є високопродуктивним представником лінійки процесорів третього " +
            "покоління Intel Core, створених на основі архітектури Ivy Bridge. Цей процесор призначений для " +
            "роботи в системах із сокетом LGA 1155 і ідеально підходить для складання офісних, домашніх і " +
            "мультимедійних комп'ютерів. Версія постачається в OEM-форматі (tray), що робить її оптимальним" +
            " вибором для професійних збирачів системних блоків.\n" +
            "\n" +
            "Детальні характеристики процесора Intel Core i3-3240\n" +
            "Архітектура ядра та продуктивність\n" +
            "Процесор Intel Core i3-3240 побудований на базі 22-нм архітектури Ivy Bridge, що забезпечує " +
            "високий рівень продуктивності та енергоефективності.\n" +
            "\n" +
            "Назва ядра: Ivy Bridge.\n" +
            "Тактова частота: 3.4 ГГц. Цей показник дозволяє процесору справлятися з більшістю повсякденних " +
            "завдань, включаючи роботу з офісними програмами, мультимедіа та інтернет-серфінгом.\n" +
            "Технологія Hyper-Threading: підтримує 4 потоки для ефективної багатозадачності.\n" +
            "Інтегрована графіка\n" +
            "Процесор оснащений вбудованою графічною підсистемою Intel HD Graphics 2500, яка надає такі можливості:\n" +
            "\n" +
            "Підтримка відтворення відео у форматі HD.\n" +
            "Робота з декількома моніторами.\n" +
            "Запуск базових і менш вимогливих ігор.\n" +
            "Інтегрована графіка ідеально підходить для повсякденного використання, усуваючи необхідність у" +
            " дискретній відеокарті.\n" +
            "Розмір корпусу та ядра\n" +
            "Розмір корпусу процесора: відповідає стандарту для сокета LGA 1155, забезпечуючи легкість інтеграції" +
            " з більшістю материнських плат.\n" +
            "Розмір ядра процесора: виконаний за 22-нм технологією, що забезпечує компактність, енергоефективність " +
            "і високу щільність транзисторів.\n" +
            "Канали пам’яті та підтримка ОЗП\n" +
            "Intel Core i3-3240 підтримує двоканальну архітектуру оперативної пам’яті:\n" +
            "\n" +
            "Тип пам’яті: DDR3.\n" +
            "Максимальна частота: до 1600 МГц.\n" +
            "Максимальний обсяг оперативної пам’яті: 32 ГБ, чого більш ніж достатньо для більшості сучасних" +
            " застосунків і багатозадачності.\n" +
            "Двоканальний режим забезпечує високу пропускну здатність пам’яті й покращує продуктивність системи.\n" +
            "\n" +
            "Кількість контактів і роз’єм\n" +
            "Процесор розрахований на встановлення в роз’єм LGA 1155, що гарантує сумісність із широким спектром" +
            " материнських плат.\n" +
            "\n" +
            "Кількість контактів: 1155.\n" +
            "Ядра, потоки та транзистори\n" +
            "Intel Core i3-3240 оснащений двома фізичними ядрами та чотирма потоками, завдяки технології Hyper-Threading.\n" +
            "\n" +
            "Кількість транзисторів: близько 1,4 мільярда.\n" +
            "Процесор ідеально підходить для багатозадачної роботи, забезпечуючи стабільну продуктивність у різних застосунках.\n" +
            "\n" +
            "Кеш-пам’ять\n" +
            "Процесор оснащений трирівневою кеш-пам’яттю для прискорення обробки даних:\n" +
            "\n" +
            "Кеш L1: 2 x 32 КБ для даних і 2 x 32 КБ для інструкцій.\n" +
            "Кеш L2: 2 x 256 КБ.\n" +
            "Кеш L3: загальний обсяг 3 МБ, який використовується всіма ядрами процесора.\n" +
            "Максимальна пропускна здатність пам’яті\n" +
            "Максимальна пропускна здатність пам’яті становить 25,6 ГБ/с, що дозволяє ефективно обробляти дані " +
            "й мінімізувати затримки.\n" +
            "\n" +
            "Енергоспоживання та температура\n" +
            "Intel Core i3-3240 розроблений з урахуванням вимог енергоефективності:\n" +
            "\n" +
            "Потужність (TDP): 55 Вт, що робить процесор оптимальним вибором для тихих і компактних систем.\n" +
            "Максимально допустима температура ядра: 65,3°C, що забезпечує стабільність роботи за рекомендованих навантажень.\n" +
            "Частота шини даних та її тип\n" +
            "Процесор підтримує частоту шини даних 5 GT/s, що реалізується через інтерфейс DMI (Direct Media Interface). " +
            "Цей показник гарантує високу швидкість передачі даних між процесором та іншими компонентами системи.\n" +
            "\n" +
            "Розблокований множник\n" +
            "Множник у Intel Core i3-3240 не розблокований, що виключає можливість розгону процесора. Це дозволяє " +
            "зосередитися на стабільній роботі в штатних режимах.\n" +
            "\n" +
            "Енергозберігаючі технології\n" +
            "Intel Core i3-3240 підтримує широкий набір енергозберігаючих технологій, які знижують споживання " +
            "енергії та покращують ефективність роботи:\n" +
            "\n" +
            "Intel SpeedStep Technology: динамічне змінення частоти та напруги залежно від навантаження.\n" +
            "Thermal Monitoring Technologies: запобігання перегріву шляхом зниження частоти за досягнення критичної" +
            " температури.\n" +
            "Idle States: переведення процесора в енергозберігаючий режим під час простою.\n" +
            "Комплектація\n" +
            "Процесор постачається у вигляді OEM-версії (tray) і не включає систему охолодження. Користувач може " +
            "вибрати кулер відповідно до своїх потреб. У комплект входить термопаста, яка забезпечує надійну теплопередачу між процесором і охолоджувальним пристроєм.\n" +
            "\n" +
            "Висновок\n" +
            "Intel Core i3-3240 3.4GHz — це надійне рішення для складання продуктивних офісних і домашніх комп’ютерів. " +
            "Висока тактова частота, двоканальна пам’ять і підтримка інтегрованої графіки роблять процесор " +
            "універсальним вибором для роботи та мультимедіа. Завдяки енергоефективності й продуманим технологіям " +
            "Intel Core i3-3240 ідеально підходить для користувачів, які шукають баланс між продуктивністю та економічністю.",
        numberOfItems: 20
    },
    {
        id: 14,
        componentName: "Intel Core i5 3470",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/NdsDVbd7/3.webp",
            "https://i.ibb.co/MQTzDVc/2.webp",
            "https://i.ibb.co/XZP7g6zK/1.webp",
        ],
        price: 118,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1155",
            processorFrequencyGHz: 3.6,
            numberOfCores: "4cores",
            numberOfThreads: "4threads",
            l3cacheMB: 6
        },
        description: "- Просунута продуктивність із Intel Core i5-3470\n" +
            "\n" +
            "Процесор Intel Core i5-3470 є потужним рішенням для вашого комп'ютера, забезпечуючи високу" +
            " продуктивність і ефективність у виконанні найвибагливіших завдань. Поєднуючи чотири ядра і можливість" +
            " обробки до чотирьох потоків, він є ідеальним вибором як для повсякденних завдань, так і для ігор і " +
            "професійного використання.\n" +
            "\n" +
            "- Оптимізована продуктивність\n" +
            "\n" +
            "З частотою роботи до 3.6 ГГц та технологією Turbo Boost, процесор Intel Core i5-3470 забезпечує" +
            "швидку та плавну роботу вашої системи навіть при виконанні найінтенсивніших завдань. Незалежно від " +
            "того, чи ви працюєте над багатозадачними проектами, граєте в останні ігри або редагуєте відео, цей " +
            "процесор забезпечить вас усім необхідним ресурсами.\n" +
            "\n" +
            "- Чудова мультимедійна продуктивність\n" +
            "\n" +
            "З підтримкою технології Intel HD Graphics 2500 процесор Intel Core i5-3470 забезпечує приголомшливі " +
            "візуальні враження. Він здатний впоратися із потоковою передачею відео високої чіткості, забезпечуючи" +
            " плавне відтворення та редагування відеоматеріалів без затримок та спотворень.\n" +
            "\n" +
            "- Енергоефективність та надійність\n" +
            "\n" +
            "З низьким енергоспоживанням та просунутою архітектурою, процесор Intel Core i5-3470 забезпечує не лише " +
            "високу продуктивність, а й економічне використання ресурсів. Завдяки цьому ваша система працюватиме " +
            "ефективно та надійно навіть при тривалих навантаженнях.\n" +
            "\n" +
            "- Висновок\n" +
            "\n" +
            "Intel Core i5-3470 – це ідеальне рішення для тих, хто цінує продуктивність, надійність та " +
            "енергоефективність. З його допомогою ви зможете насолоджуватися швидкою роботою вашого комп'ютера " +
            "і максимально ефективно використовувати його потенціал як у повсякденних завданнях, так і більш " +
            "вимогливих додатках та іграх.",
        numberOfItems: 20
    },
    {
        id: 15,
        componentName: "Intel Core i7 2600",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/q3TM9MSt/3.webp",
            "https://i.ibb.co/VY1zzgnJ/2.webp",
            "https://i.ibb.co/TMBkmnzQ/1.webp",
        ],
        price: 126,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1155",
            processorFrequencyGHz: 3.8,
            numberOfCores: "4cores",
            numberOfThreads: "8threads",
            l3cacheMB: 8
        },
        description: "Процесор Intel Core i7-2600 був представлений на початку 2011 року і входить " +
            "до сімейства другого покоління процесорів Intel Core, також відомого як Sandy Bridge. Він " +
            "побудований на 32-нм техпроцесі і пропонує чотири фізичні ядра з підтримкою Hyper-Threading, що " +
            "забезпечує обробку до восьми потоків даних одночасно.\n" +
            "\n" +
            "Частота базового такту процесора становить 3.4 ГГц, а за наявності технології Turbo Boost 2.0 може " +
            "збільшуватися до 3.8 ГГц залежно від навантаження. Кеш-пам'ять третього рівня L3 становить 8 МБ, що " +
            "сприяє ефективнішій обробці даних.\n" +
            "\n" +
            "Він підтримує набори інструкцій, такі як SSE4.1/4.2, AVX, що підвищує продуктивність мультимедійних " +
            "додатках. Також важливо відзначити вбудований графічний прискорювач Intel HD Graphics 2000, що забезпечує " +
            "базову графічну продуктивність.\n" +
            "\n" +
            "Тепловиділення (TDP) процесора становить 95 Вт. Він сумісний із сокетом LGA1155 та підтримує пам'ять DDR3" +
            " з максимальною частотою 1333 МГц. В цілому, Intel Core i7-2600 є потужним процесором для безлічі завдань, " +
            "включаючи ігри, мультимедійні програми та обробку даних.",
        numberOfItems: 20
    },
    {
        id: 16,
        componentName: "Intel Core i7 3700",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/RkLcVGJf/3.webp",
            "https://i.ibb.co/qF1GQk3j/2.webp",
            "https://i.ibb.co/TMSP8pQ5/1.webp",
        ],
        price: 126,
        processorOptions: {
            producer: "Intel",
            processorSocket: "LGA1155",
            processorFrequencyGHz: 3.9,
            numberOfCores: "4cores",
            numberOfThreads: "8threads",
            l3cacheMB: 8
        },
        description: "Процесор Intel Core i7 3-го покоління забезпечує найвищу продуктивність вашого ПК-моноблока " +
            "або стандартного ПК. Процесор Intel Core i7 впорається з самими ресурсоємними завданнями - ви побачите" +
            " і відчуєте різницю при перегляді контенту в форматі HD або 3D, роботі в багатозадачному режимі або при" +
            " відтворенні мультимедіа.\n" +
            "\n" +
            "Процесор Intel Core i7 містять передові технології, які забезпечують більш швидку і плавну роботу, " +
            "а також більш широкі можливості і якість зображення при виконанні всіх ваших улюблених ресурсномістких завдань" +
            " - від редагування фільмів до найбільш захоплюючих ігор.\n" +
            "Динамічне збільшення продуктивності\n" +
            "Технологія Intel Turbo Boost 2.0 активується, коли операційна система запитує стан продуктивність" +
            " процесора.\n" +
            "\n" +
            "Максимальна частота технології Intel Turbo Boost 2.0 залежить від числа активних ядер. Кількість" +
            " часу, що проводиться процесором в стані під керуванням технології Intel Turbo Boost 2.0, залежить від" +
            " робочого навантаження і операційного середовища!",
        numberOfItems: 10
    },
    {
        id: 17,
        componentName: "AMD Athlon 64 X2 4800",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/fdszQ0Pz/3.webp",
            "https://i.ibb.co/1fj3FnY2/2.webp",
            "https://i.ibb.co/nMGdvTbj/1.webp",
        ],
        price: 98,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM2",
            processorFrequencyGHz: 2.5,
            numberOfCores: "2cores",
            numberOfThreads: "2threads",
            l3cacheMB: 1
        },
        description: "Процессор AMD Athlon 64 X2 4800+\n" +
            "Цей процесор від AMD, модель Athlon 64 X2 4800+, має тактову частоту 2.50GHz та кеш-пам'ять об'ємом 1MB." +
            " Призначений для мультимедійних систем та офісних комп'ютерів. Ідеально підходить для тих, хто шукає " +
            "надійний процесор для базових завдань.",
        numberOfItems: 10
    },
    {
        id: 18,
        componentName: "AMD Athlon 64 X2 5000",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/S7DDM6Q0/3.webp",
            "https://i.ibb.co/LzfVvYnK/2.webp",
            "https://i.ibb.co/0jybD2vH/1.webp",
        ],
        price: 102,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM2",
            processorFrequencyGHz: 2.6,
            numberOfCores: "2cores",
            numberOfThreads: "2threads",
            l3cacheMB: 1
        },
        description: "Дані процесори є Б/У. ( Привезені з Німеччини - ретельно перевірені під навантаженням. " +
            "Без будь-яких вад ). Надається символічна гарантія на перевірку працездатності терміном 14 днів. " +
            "Гарантія дається виключно \"на обмін\" .\n" +
            "Процесор на Socket AM2 - AMD Athlon 64 X2 5000 . Тактова частота 2 Ядра по 2600 МГц. Точна маркування " +
            "процесора - ADO5000IAA5DO.",
        numberOfItems: 10
    },
    {
        id: 19,
        componentName: "AMD Athlon 64 X2 5600",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/S7DDM6Q0/3.webp",
            "https://i.ibb.co/LzfVvYnK/2.webp",
            "https://i.ibb.co/0jybD2vH/1.webp",
        ],
        price: 108,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM2",
            processorFrequencyGHz: 2.9,
            numberOfCores: "2cores",
            numberOfThreads: "2threads",
            l3cacheMB: 1
        },
        description: "\n" +
            "Процесор AMD Athlon 64 X2 5600+ — це високопродуктивне рішення, створене на основі перевіреної часом " +
            "архітектури та розраховане на виконання широкого спектра завдань. Цей процесор є оптимальним поєднанням " +
            "потужності, енергоефективності та надійності, що робить його чудовим вибором як для домашнього використання, " +
            "так і для офісних систем. Розглянемо його характеристики та особливості детально.\n" +
            "\n" +
            "Архітектура ядра\n" +
            "Процесор побудований на базі архітектури K8, розробленої AMD. Це вдосконалена архітектура, яка забезпечує" +
            " оптимізовану продуктивність для роботи з 64-бітними застосунками та сумісність із 32-бітними програмами. " +
            "K8 характеризується підтримкою технології HyperTransport, що дозволяє мінімізувати затримки передачі даних" +
            " між компонентами системи.\n" +
            "\n" +
            "Інтегрована графіка\n" +
            "AMD Athlon 64 X2 5600+ не має вбудованого графічного ядра. Це означає, що для роботи з графікою потрібно" +
            " встановити дискретну відеокарту. Такий підхід забезпечує можливість використання потужних графічних " +
            "адаптерів для виконання ресурсоємних завдань, таких як редагування відео, 3D-моделювання та сучасні ігри.\n" +
            "\n" +
            "Кількість каналів пам’яті\n" +
            "Ця модель підтримує двоканальний режим роботи з оперативною пам’яттю. Це дозволяє значно збільшити пропускну" +
            " здатність системи, забезпечуючи вищу швидкість передачі даних між процесором та оперативною пам’яттю.\n" +
            "\n" +
            "Кількість контактів\n" +
            "Процесор AMD Athlon 64 X2 5600+ призначений для встановлення в роз'єм Socket AM2. Кількість контактів на " +
            "процесорі становить 940, що відповідає вимогам роз'єму та забезпечує надійне з’єднання з материнською платою.\n" +
            "\n" +
            "Кількість потоків\n" +
            "Процесор оснащений двома обчислювальними ядрами, кожне з яких здатне обробляти один потік даних. Таким чином, " +
            "загальна кількість потоків дорівнює двом. Це забезпечує хорошу продуктивність під час багатозадачної роботи " +
            "та обробки кількох програм одночасно.\n" +
            "\n" +
            "Кількість транзисторів\n" +
            "На кристалі процесора розташовано близько 227 мільйонів транзисторів. Така кількість транзисторів забезпечує" +
            " стабільну роботу та високу продуктивність процесора навіть за значних навантажень.\n" +
            "\n" +
            "Максимальна пропускна здатність пам’яті\n" +
            "Процесор підтримує оперативну пам’ять стандарту DDR2 з тактовою частотою до 800 МГц. Максимальна пропускна" +
            " здатність пам’яті сягає 12.8 ГБ/с, що дозволяє ефективно працювати з великими обсягами даних і складними " +
            "завданнями.\n" +
            "\n" +
            "Максимально допустима температура\n" +
            "Максимальна робоча температура процесора AMD Athlon 64 X2 5600+ становить 70°C. Це показник безпеки, який" +
            " гарантує стабільну роботу пристрою за дотримання рекомендацій щодо охолодження.\n" +
            "\n" +
            "Потужність TDP\n" +
            "Тепловиділення (TDP) цього процесора становить 65 Вт. Це помірний показник, який свідчить про хорошу " +
            "енергоефективність моделі. Така потужність дозволяє використовувати процесор у системах з обмеженими можливостями" +
            " охолодження.\n" +
            "\n",
        numberOfItems: 10
    },
    {
        id: 20,
        componentName: "AMD Phenom X4 9650",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/TDkHgXrV/3.webp",
            "https://i.ibb.co/7d7Pdxjj/2.webp",
            "https://i.ibb.co/0jqLSjnS/1.webp",
        ],
        price: 118,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM2",
            processorFrequencyGHz: 2.3,
            numberOfCores: "4cores",
            numberOfThreads: "4threads",
            l3cacheMB: 2
        },
        description: "AMD Phenom X4 9650 - процесор для настільних ПК із 4 ядрами, випущений у березні 2008 року." +
            " Він входить до лінійки Phenom X4, використовує архітектуру Agena з роз'ємом Socket AM2+. Phenom X4 9650" +
            " має 2 МБ кеша L3 і працює на частоті 2,3 ГГц. AMD створює Phenom X4 9650 по 65 нм техпроцесу з використанням " +
            "450 мільйонів транзисторів. Множник у Phenom X4 9650 заблокований, що обмежує його можливості розгону.\n" +
            "\n" +
            "За TDP 95 Вт Phenom X4 9650 споживає чималу кількість енергії, тому потрібне гідне охолодження. Для зв'язку " +
            "з іншими компонентами системи Phenom X4 9650 використовує з'єднання PCI-Express Gen 2. Цей процесор не має" +
            " інтегрованої графіки, вам знадобиться окрема відеокарта.\n" +
            "\n" +
            "На Phenom X4 9650 доступна апаратна віртуалізація, що неабияк підвищує продуктивність віртуальних машин.",
        numberOfItems: 10
    },
    {
        id: 21,
        componentName: "AMD Athlon II x4 640",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/LKZP582/3.webp",
            "https://i.ibb.co/NdCj5rDH/2.webp",
            "https://i.ibb.co/7tPLPY8n/1.webp",
        ],
        price: 121,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM3",
            processorFrequencyGHz: 3.0,
            numberOfCores: "4cores",
            numberOfThreads: "4threads",
            l3cacheMB: 1
        },
        description: "AMD Athlon II X4 640 – це чотириядерний процесор із тактовою частотою 3.00 ГГц, який ідеально " +
            "підходить для багатозадачності, роботи з мультимедійними додатками та офісними завданнями. Завдяки високій" +
            " продуктивності та енергоефективності, процесор забезпечує стабільну і швидку роботу навіть за умов " +
            "інтенсивної експлуатації.\n" +
            "\n" +
            "Архітектура ядра\n" +
            "Модель ядра: Propus.\n" +
            "Техпроцес: 45 нм.\n" +
            "Технологія: SOI (Silicon on Insulator) мінімізує тепловиділення та знижує енергоспоживання, підвищуючи" +
            " стабільність роботи процесора.\n" +
            "Підтримка 64-бітної архітектури робить процесор сумісним із сучасними операційними системами та додатками.\n" +
            "Архітектура Propus відрізняється відсутністю кешу третього рівня (L3), що дозволяє зменшити вартість " +
            "процесора без значних втрат у продуктивності.\n" +
            "Наявність інтегрованої графіки\n" +
            "Інтегрована графіка: відсутня.\n" +
            "Для роботи потрібна установка дискретної відеокарти, що надає користувачу гнучкість у виборі графічного" +
            " рішення залежно від його завдань.\n" +
            "Кількість каналів пам’яті\n" +
            "Режим роботи пам’яті: двоканальний.\n" +
            "Двоканальна архітектура збільшує пропускну здатність оперативної пам’яті, що забезпечує покращену продуктивність " +
            "при обробці даних, запуску додатків і роботі з великими обсягами інформації.\n" +
            "Кількість контактів\n" +
            "Сокет: AM2+ та AM3.\n" +
            "Кількість контактів: 938.\n" +
            "Процесор підходить як для модернізації старих систем, так і для створення нових завдяки універсальному дизайну" +
            " сокета.\n" +
            "Кількість потоків\n" +
            "Кількість ядер: 4.\n" +
            "Кількість потоків: 4.\n" +
            "Чотири незалежних ядра забезпечують високу продуктивність при виконанні багатозадачних операцій, таких як " +
            "робота з кількома додатками одночасно, обробка мультимедіа та використання офісних інструментів.\n" +
            "Кількість транзисторів\n" +
            "Кількість транзисторів: близько 300 мільйонів.\n" +
            "Висока щільність транзисторів забезпечує надійність і стабільність роботи процесора навіть за великих" +
            " навантажень.\n" +
            "Максимальна пропускна здатність пам’яті\n" +
            "Типи пам’яті: DDR2 та DDR3.\n" +
            "Максимальна частота пам’яті: до 1333 МГц.\n" +
            "Пропускна здатність: до 21,3 ГБ/с.\n" +
            "Висока швидкість передачі даних між процесором і оперативною пам’яттю забезпечує плавну роботу системи " +
            "навіть за високих обчислювальних навантажень.\n" +
            "Максимально допустима температура\n" +
            "Максимальна температура: 71°C.\n" +
            "Процесор стійкий до перегріву, але для стабільної роботи рекомендується використовувати якісну систему " +
            "охолодження.\n" +
            "Потужність TDP\n" +
            "TDP: 95 Вт.\n" +
            "Процесор має помірне тепловиділення, що робить його придатним для використання в системах із надійним" +
            " охолодженням.\n" +
            "Назва ядра\n" +
            "Кодова назва ядра: Propus.\n" +
            "Це перевірене часом ядро забезпечує надійну продуктивність для виконання як базових, так і ресурсоємних " +
            "завдань.\n" +
            "Обсяг кеш-пам’яті\n" +
            "L1: 512 КБ (по 64 КБ на кожне ядро для інструкцій і даних).\n" +
            "L2: 2 МБ (по 512 КБ на кожне ядро).\n" +
            "L3: відсутній.\n" +
            "Кеш другого рівня забезпечує ефективну обробку даних, мінімізуючи затримки і покращуючи загальну " +
            "продуктивність процесора.\n" +
            "\n" +
            "Розблокований множник\n" +
            "Множник: заблокований.\n" +
            "Процесор призначений для стабільної роботи в стандартних умовах без можливості розгону, що робить його" +
            " ідеальним вибором для користувачів, яким важлива надійність системи.\n" +
            "Тип пам’яті та максимальний обсяг\n" +
            "Типи пам’яті: DDR2 та DDR3.\n" +
            "Максимальний обсяг пам’яті: до 16 ГБ.\n" +
            "Процесор універсальний у використанні завдяки підтримці двох стандартів пам’яті, що робить його придатним" +
            " для модернізації старих ПК та складання нових систем.\n" +
            "Частота шини даних\n" +
            "Частота: 2000 МГц.\n" +
            "Технологія HyperTransport 3.0 підвищує швидкість передачі даних між процесором та іншими компонентами системи.\n" +
            "Енергозберігаючі технології\n" +
            "Cool’n’Quiet 3.0:\n" +
            "Регулює тактову частоту і напругу процесора залежно від поточного навантаження.\n" +
            "Знижує енергоспоживання, зменшує тепловиділення та рівень шуму системи.\n" +
            "Подовжує термін служби компонентів і знижує загальні експлуатаційні витрати.\n" +
            "Комплектація\n" +
            "Процесор: AMD Athlon II X4 640 (виконання tray).\n" +
            "Термопаста: для забезпечення надійного теплообміну між процесором і системою охолодження.\n" +
            "Висновок\n" +
            "AMD Athlon II X4 640 – це продуктивний чотириядерний процесор для користувачів, яким потрібна надійна і " +
            "стабільна робота системи. Він ідеально підходить для багатозадачності, роботи з мультимедіа, офісних завдань" +
            " і базових обчислювальних операцій. Завдяки сумісності з широким спектром платформ і доступній ціні, цей " +
            "процесор стане чудовим вибором для складання чи модернізації ПК.\n" +
            "\n" +
            "Чому обрати AMD Athlon II X4 640?\n" +
            "Чотири ядра: висока продуктивність для багатозадачності та обробки даних.\n" +
            "Сумісність: підтримка DDR2/DDR3 і сокетів AM2+/AM3.\n" +
            "Енергоефективність: технології енергозбереження та TDP 95 Вт.\n" +
            "Гнучкість: підходить для оновлення старих систем і складання нових ПК.\n" +
            "AMD Athlon II X4 640 – це ідеальний вибір для тих, хто шукає доступний і надійний процесор для щоденної роботи.",
        numberOfItems: 10
    },
    {
        id: 22,
        componentName: "AMD Phenom II X4 965",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/5WGpBDmR/3.webp",
            "https://i.ibb.co/hJnkCTtW/2.webp",
            "https://i.ibb.co/mw99zdd/1.webp",
        ],
        price: 124,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM3",
            processorFrequencyGHz: 3.4,
            numberOfCores: "4cores",
            numberOfThreads: "4threads",
            l3cacheMB: 6
        },
        description: "Опис процесора AMD Phenom II X4 965 Black Edition (HDZ965FBK4DGM)\n" +
            "Загальні відомості\n" +
            "AMD Phenom II X4 965 Black Edition — це потужний чотириядерний процесор, створений для користувачів, " +
            "які шукають високу продуктивність та універсальність. Завдяки тактовій частоті 3.4 ГГц та розблокованому " +
            "множнику, ця модель є чудовим вибором для ентузіастів, геймерів та професіоналів, які працюють із " +
            "ресурсоємними додатками. Процесор підтримує сучасні технології та сумісний із широким спектром системних " +
            "плат, що робить його ідеальним варіантом для складання потужного ПК.\n" +
            "\n" +
            "Архітектура ядра\n" +
            "Процесор побудований на архітектурі K10.5, яка забезпечує високу продуктивність та енергоефективність. " +
            "У основі пристрою лежить ядро Deneb, виготовлене за 45-нм технологічним процесом. Ця архітектура відома " +
            "своєю оптимізованою багатозадачністю та покращеною обробкою складних обчислювальних операцій.\n" +
            "\n" +
            "Ядро Deneb розроблене для роботи в умовах інтенсивних навантажень, таких як ігри, мультимедійні програми " +
            "та програмне забезпечення для створення контенту.\n" +
            "\n" +
            "Інтегрована графіка\n" +
            "AMD Phenom II X4 965 Black Edition не оснащений інтегрованою графікою, що дозволяє користувачам обирати " +
            "дискретну відеокарту, яка найбільше відповідає їхнім задачам. Це рішення особливо корисне для геймерів та" +
            " професіоналів, яким потрібна висока продуктивність графіки.\n" +
            "\n" +
            "Кількість каналів пам’яті\n" +
            "Процесор підтримує двоканальний режим роботи пам’яті, що підвищує пропускну здатність оперативної пам’яті" +
            " та дозволяє системі ефективно обробляти дані навіть за високих навантажень.\n" +
            "\n" +
            "Кількість контактів\n" +
            "AMD Phenom II X4 965 Black Edition використовує роз'єм Socket AM3, який має 938 контактів. Це забезпечує " +
            "надійне підключення процесора до материнської плати, а також сумісність із широким спектром системних плат," +
            " що підтримують як DDR2, так і DDR3.\n" +
            "\n" +
            "Кількість потоків\n" +
            "Процесор має 4 потоки, які відповідають чотирьом фізичним ядрам. Це гарантує високу продуктивність у " +
            "багатозадачних сценаріях і дозволяє системі ефективно розподіляти робоче навантаження.\n" +
            "\n" +
            "Кількість транзисторів\n" +
            "Процесор містить близько 758 мільйонів транзисторів, виконаних за 45-нм техпроцесом. Це забезпечує баланс " +
            "між високою продуктивністю та помірним тепловиділенням.\n" +
            "\n" +
            "Максимальна пропускна здатність пам'яті\n" +
            "Процесор підтримує оперативну пам’ять DDR3, забезпечуючи максимальну пропускну здатність до 21,3 ГБ/с. Це " +
            "покращує продуктивність при роботі з великими обсягами даних і ресурсоємними програмами.\n" +
            "\n" +
            "Максимально допустима температура\n" +
            "Максимальна робоча температура процесора становить 62°C, що вимагає використання якісної системи охолодження " +
            "для забезпечення стабільної роботи за високих навантажень.\n" +
            "\n" +
            "Потужність TDP\n" +
            "Тепловиділення процесора (TDP) становить 125 Вт, що робить його потужним рішенням для високопродуктивних " +
            "систем. Це значення TDP дозволяє справлятися з інтенсивними навантаженнями без втрати продуктивності.\n" +
            "\n" +
            "Назва ядра\n" +
            "Ядро процесора називається Deneb, і воно є одним із найпродуктивніших і найнадійніших рішень AMD у лінійці" +
            " Phenom II.\n" +
            "\n" +
            "Обсяг кеш-пам’яті\n" +
            "AMD Phenom II X4 965 Black Edition оснащений багаторівневою системою кешування:\n" +
            "\n" +
            "Кеш L1: 128 КБ на кожне ядро (загальний обсяг — 512 КБ).\n" +
            "Кеш L2: 512 КБ на кожне ядро (загальний обсяг — 2 МБ).\n" +
            "Кеш L3: загальний обсяг 6 МБ, який використовується всіма ядрами.\n" +
            "Така структура кеш-пам’яті дозволяє мінімізувати затримки та прискорити обробку даних, покращуючи загальну" +
            " продуктивність системи.\n" +
            "\n" +
            "Розблокований множник\n" +
            "Процесор має розблокований множник, що робить його ідеальним вибором для розгону. Це дозволяє ентузіастам" +
            " збільшити тактову частоту та досягти додаткової продуктивності.\n" +
            "\n" +
            "Тип пам'яті та максимальний обсяг\n" +
            "Процесор підтримує оперативну пам’ять типів DDR2 і DDR3, що робить його універсальним і придатним для різних " +
            "конфігурацій. Максимальний обсяг оперативної пам’яті становить 16 ГБ, чого достатньо для більшості сучасних " +
            "завдань, включаючи ігри та професійну роботу.\n" +
            "\n" +
            "Частота шини даних\n" +
            "Частота системної шини становить 2000 МГц, що забезпечує швидку передачу даних між процесором та іншими " +
            "компонентами системи.\n" +
            "\n" +
            "Енергозберігаючі технології\n" +
            "AMD Phenom II X4 965 Black Edition підтримує ряд енергозберігаючих технологій, які підвищують ефективність" +
            " роботи та знижують енергоспоживання:\n" +
            "\n" +
            "Cool'n'Quiet: динамічно регулює частоту і напругу процесора, зменшуючи рівень енергоспоживання та шуму системи.\n" +
            "PowerNow!: оптимізує енергоспоживання залежно від поточного навантаження, зменшуючи витрати енергії в режимі простою.\n" +
            "C1E Halt State: переводить процесор у енергозберігаючий режим за низького навантаження, що допомагає знизити " +
            "тепловиділення.\n" +
            "Ці технології забезпечують стабільність роботи системи та подовжують термін служби компонентів.\n" +
            "\n" +
            "Комплектація\n" +
            "Комплект постачання включає:\n" +
            "\n" +
            "Процесор AMD Phenom II X4 965 Black Edition (HDZ965FBK4DGM);\n" +
            "Термопасту для встановлення системи охолодження.\n" +
            "Висновок\n" +
            "AMD Phenom II X4 965 Black Edition — це потужний процесор із чудовою продуктивністю та широкими можливостями" +
            " для розгону. Завдяки розблокованому множнику, високій пропускній здатності пам’яті та підтримці сучасних " +
            "технологій, цей процесор ідеально підходить для геймерів, ентузіастів та професіоналів, яким потрібна " +
            "висока продуктивність та надійність.",
        numberOfItems: 10
    },
    {
        id: 23,
        componentName: "AMD Phenom II X6 1055T",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/tPBPmh11/3.webp",
            "https://i.ibb.co/R474vs30/2.webp",
            "https://i.ibb.co/z1hHYrv/1.webp",
        ],
        price: 132,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM3",
            processorFrequencyGHz: 2.8,
            numberOfCores: "6cores",
            numberOfThreads: "6threads",
            l3cacheMB: 6
        },
        description: "Збільште обчислювальну потужність вашого ПК з процесором AMD Phenom II X6 1055T. Цей шестиядерний" +
            " процесор забезпечує чудову продуктивність для багатозадачності, ресурсоємних програм та сучасних ігор.\n" +
            "\n" +
            "Характеристики:\n" +
            "✅ 6 ядер / 6 потоків – Висока продуктивність для багатозадачних сценаріїв та вимогливих програм.\n" +
            "✅ Тактова частота: Базова — 2.8 ГГц, Turbo Core — до 3.3 ГГц, що забезпечує швидку і плавну роботу " +
            "системи.\n" +
            "✅ 9 МБ кешу (L2 + L3) – Швидкий доступ до даних для підвищення ефективності роботи.\n" +
            "✅ Енергоефективність: TDP 95 Вт, збалансоване співвідношення потужності та енергоспоживання.\n" +
            "✅ Сумісність із сокетом AM3 – Легка інтеграція в систему на цій платформі.\n" +
            "✅ Підтримка розгону – Відкритий множник дозволяє збільшити частоту для додаткової продуктивності.\n" +
            "\n" +
            "Ідеально підходить для геймерів і користувачів, яким важлива висока потужність та стабільність роботи системи." +
            " Оцініть надійність і ефективність AMD Phenom II X6 1055T!",
        numberOfItems: 10
    },
    {
        id: 24,
        componentName: "AMD Phenom II x4 955",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/zH857xRX/3.webp",
            "https://i.ibb.co/7dJnKgJK/2.webp",
            "https://i.ibb.co/9m41F0C2/1.webp",
        ],
        price: 126,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM3",
            processorFrequencyGHz: 3.2,
            numberOfCores: "4cores",
            numberOfThreads: "4threads",
            l3cacheMB: 6
        },
        description: "AMD Phenom II X4 955 — це чотириядерний процесор на архітектурі Deneb, випущений у 2009 році. " +
            "Один із найпопулярніших процесорів свого часу завдяки розблокованому множнику та відмінній продуктивності " +
            "у своєму класі.\n" +
            "\n" +
            "Ключові особливості:\n" +
            "\n" +
            "Чотири ядра і чотири потоки: забезпечують добру багатозадачність і продуктивність у повсякденних і ігрових" +
            " задачах;\n" +
            "Тактова частота 3.2 ГГц: висока частота для стабільної роботи з важкими програмами;\n" +
            "Кеш L3 об’ємом 6 МБ + по 512 КБ L2 на ядро: прискорює доступ до даних і зменшує затримки;\n" +
            "Розблокований множник (Black Edition): підтримує розгін для ентузіастів;\n" +
            "Підтримка пам’яті DDR2 і DDR3: дозволяє гнучко обирати компоненти;\n" +
            "TDP — 125 Вт: вимагає якісного охолодження, особливо під час розгону.\n" +
            "Ідеальне застосування:\n" +
            "\n" +
            "Підходить для складання продуктивної системи на старій платформі. Добре підходить для ігор, офісу" +
            " та мультимедіа за наявності відповідної відеокарти й охолодження.",
        numberOfItems: 10
    },
    {
        id: 25,
        componentName: "AMD Ryzen 3 3100",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/JF5JGD5F/3.webp",
            "https://i.ibb.co/s9wYNRz0/2.webp",
            "https://i.ibb.co/VWwVWS4M/1.webp",
        ],
        price: 138,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM4",
            processorFrequencyGHz: 3.6,
            numberOfCores: "4cores",
            numberOfThreads: "8threads",
            l3cacheMB: 16
        },
        description: "Процесори AMD Ryzen 3-го покоління\n" +
            "Прекрасна продуктивність. Створено перемагати.\n" +
            "\n" +
            "Платформа з роз'ємом AM4 для процесорів AMD Ryzen\n" +
            "Масова обчислювальна платформа компанії AMD оновлена з випуском нового чипсета X570 з підтримкою PCIe 4.0.\n" +
            "\n" +
            "Технологія AMD StoreMI\n" +
            "Програмне забезпечення, яке об'єднує швидкість твердотільного накопичувача та місткість жорсткого диска в " +
            "одному швидкому і простому в керуванні диску. Це програмне забезпечення надається безплатно з материнськими " +
            "платами AMD X570.\n" +
            "\n" +
            "Технологія AMD SenseMI\n" +
            "Технології AMD SenseMI, якими обладнаний Ryzen, використовують справжній \"штучний інтелект\", що прискорює " +
            "роботу процесора.\n" +
            "\n" +
            "Програма AMD Ryzen Master\n" +
            "Проста і потужна програма для розгону процесорів AMD Ryzen.",
        numberOfItems: 10
    },
    {
        id: 26,
        componentName: "AMD Ryzen 5 3600",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/QjKf3NzP/3.webp",
            "https://i.ibb.co/GfjVd92w/2.webp",
            "https://i.ibb.co/yndkcp9N/1.webp",
        ],
        price: 142,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM4",
            processorFrequencyGHz: 3.6,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 32
        },
        description: "Процесори AMD Ryzen 3-го покоління\n" +
            "Висока продуктивність. Створене перемагати.\n" +
            "\n" +
            "AMD Ryzen 5 для ігор\n" +
            "Найвища продуктивність у змагальних іграх.\n" +
            "\n" +
            "AMD Ryzen 5 для трансляцій\n" +
            "Можливість одночасної гри та захоплення зображень завдяки одній потужній системі.\n" +
            "\n" +
            "AMD Ryzen 5 для віртуальної реальності\n" +
            "Новітні технології віртуальної реальності з чітким зображенням контенту та високою швидкістю реагування.\n" +
            "\n" +
            "AMD Ryzen 5 для розробників\n" +
            "Потужний і ефективний інструмент для розробників і ентузіастів.\n" +
            "\n" +
            "Платформа з роз'ємом AM4 для процесорів AMD Ryzen\n" +
            "Масова обчислювальна платформа компанії AMD оновлена з випуском нового чипсета X570 з підтримкою PCIe 4.0.\n" +
            "\n" +
            "Технологія AMD StoreMI\n" +
            "Програмне забезпечення, яке об'єднує швидкість твердотільного накопичувача та місткість жорсткого диска в " +
            "одному швидкому і простому в керуванні диску. Це програмне забезпечення надається безплатно з материнськими " +
            "платами AMD X570.\n" +
            "\n" +
            "Технологія AMD SenseMI\n" +
            "Технології AMD SenseMI, якими обладнаний Ryzen, використовують справжній \"штучний інтелект\", що прискорює " +
            "роботу процесора.\n" +
            "\n" +
            "Програма AMD Ryzen Master\n" +
            "Проста і потужна програма для розгону процесорів AMD Ryzen.",
        numberOfItems: 10
    },
    {
        id: 27,
        componentName: "AMD Ryzen 5 5600",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/XfXTtTjP/3.webp",
            "https://i.ibb.co/7d9XN1yD/2.webp",
            "https://i.ibb.co/Y7QzhjJh/1.webp",
        ],
        price: 148,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM4",
            processorFrequencyGHz: 3.5,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 32
        },
        description: "Лідерська продуктивність для геймерів\n" +
            "Процесори AMD Ryzen 5000 серії забезпечують максимальну продуктивність, незалежно від того граєте ви " +
            "в найновіші ігри чи займаєтеся їх розробкою.\n" +
            "Ігровий процесор для ПК\n" +
            "AMD продовжує лідирувати в інноваціях ігрової індустрії, випускаючи перший у світі ігровий процесор з" +
            " chip-stacking, що значно підвищують продуктивність.\n" +
            "\n" +
            "Процесори АМD Ryzen 7 5800Х3D з технологію AMD 3D V-Cache мають безпрецедентну кеш-пам'ять З-го рівня" +
            " об'ємом 96 MB, що дозволяє грати на 15% швидше в режимі 1080р.\n" +
            "Створений для перемоги\n" +
            "Грайте в найвибагливіші ігри, насолоджуйтеся 3D рендерингом та відео на базі процесорів АМD Ryzen 5000 " +
            "серії для настільних ПK.\n" +
            "\n" +
            "Вони забезпечують неймовірну продуктивність завдяки 16 ядрам, 32 потокам, тактовій частоті до 4.9 ГГц та" +
            " кеш-пам'яттю 100 MБ для вибіркових процесорів.\n" +
            "Новаторська технологія для швидкої гри\n" +
            "Скористайтеся перевагами іноваційних технологій АМD, таких як Precision Boost 2 та Precision Boost Overdrive.\n" +
            "\n" +
            "Продуктивність відповідає ефективності 7-нм ядра Zen 3, що знаходиться в основі даних процесорів, тому ваша " +
            "установка достатньо охолоджується при високих навантаженнях.\n" +
            "\n" +
            "З PCle 4.0 ви можете максимально оптимізувати графіку та пропускну спроможність.\n" +
            "Простий апгрейд для більшості гравців\n" +
            "Процесори АМD Ryzen 5000 серії для настільних ПК сумісні з материнськими платами AMD 400 і 500 серії з " +
            "легким оновленням BIOS.\n" +
            "\n" +
            "Вони готові до точного налаштування за допомогою Ryzen Master. Підключайтеся до гри швидше, завантаживши " +
            "АМD StoreMI, щоб зберігати інформацію на жорсткому диску зі швидкістю SSD.  ",
        numberOfItems: 10
    },
    {
        id: 28,
        componentName: "AMD Ryzen 7 5800X",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/5WxHppNg/3.webp",
            "https://i.ibb.co/jkP49RQZ/2.webp",
            "https://i.ibb.co/RTZndbzv/1.webp",
        ],
        price: 152,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM4",
            processorFrequencyGHz: 3.8,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 32
        },
        description: "Лідерська продуктивність для геймерів\n" +
            "Процесори AMD Ryzen 5000 серії забезпечують максимальну продуктивність, незалежно від того граєте ви " +
            "в найновіші ігри чи займаєтеся їх розробкою.\n" +
            "Ігровий процесор для ПК\n" +
            "AMD продовжує лідирувати в інноваціях ігрової індустрії, випускаючи перший у світі ігровий процесор з" +
            " chip-stacking, що значно підвищують продуктивність.\n" +
            "\n" +
            "Процесори АМD Ryzen 7 5800Х3D з технологію AMD 3D V-Cache мають безпрецедентну кеш-пам'ять З-го рівня" +
            " об'ємом 96 MB, що дозволяє грати на 15% швидше в режимі 1080р.\n" +
            "Створений для перемоги\n" +
            "Грайте в найвибагливіші ігри, насолоджуйтеся 3D рендерингом та відео на базі процесорів АМD Ryzen 5000 " +
            "серії для настільних ПK.\n" +
            "\n" +
            "Вони забезпечують неймовірну продуктивність завдяки 16 ядрам, 32 потокам, тактовій частоті до 4.9 ГГц та" +
            " кеш-пам'яттю 100 MБ для вибіркових процесорів.\n" +
            "Новаторська технологія для швидкої гри\n" +
            "Скористайтеся перевагами іноваційних технологій АМD, таких як Precision Boost 2 та Precision Boost Overdrive.\n" +
            "\n" +
            "Продуктивність відповідає ефективності 7-нм ядра Zen 3, що знаходиться в основі даних процесорів, тому ваша " +
            "установка достатньо охолоджується при високих навантаженнях.\n" +
            "\n" +
            "З PCle 4.0 ви можете максимально оптимізувати графіку та пропускну спроможність.\n" +
            "Простий апгрейд для більшості гравців\n" +
            "Процесори АМD Ryzen 5000 серії для настільних ПК сумісні з материнськими платами AMD 400 і 500 серії з " +
            "легким оновленням BIOS.\n" +
            "\n" +
            "Вони готові до точного налаштування за допомогою Ryzen Master. Підключайтеся до гри швидше, завантаживши " +
            "АМD StoreMI, щоб зберігати інформацію на жорсткому диску зі швидкістю SSD.  ",
        numberOfItems: 10
    },
    {
        id: 29,
        componentName: "AMD Ryzen 5 7600",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/WW3MngT8/3.webp",
            "https://i.ibb.co/ynxZ3kzR/2.webp",
            "https://i.ibb.co/Z18mtpxS/1.webp",
        ],
        price: 148,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM5",
            processorFrequencyGHz: 3.8,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 32
        },
        description: "Це змінює все\n" +
            "AMD Ryzen 7000 серії - найсучасніший процесор для геймерів. \n" +
            "\n" +
            "Отримайте конкурентну перевагу з процесорами для настільних ПК AMD Ryzen 7000 серії та материнськими" +
            " платами AMD Socket AM5. Швидка гра та виняткова продуктивність для вашого домінування у грі.\n" +
            "Лідерська продуктивність\n" +
            "Створіть свою збірку з процесором AMD Ryzen 7000 серії та материнською платою AMD Socket AM5, щоб досягти" +
            " революційної продуктивності. Завдяки 16 ядрами \"Zen 4\" та 32 потоками, тактовій частоті до 5.7 ГГц та" +
            " кеш-пам'яті об'ємом 80 МБ, процесори AMD Ryzen 7000 серії допомагають вам грати на випередження.\n" +
            "Креативні технології\n" +
            "Процесори AMD Ryzen 7000 серії призначені допомагати творцям прискорити роботу, шляхом обчислювальної потужності. " +
            "Незалежно від того, чи це 3D-рендеринг, чи експорт великих відеофайлів - проєктуйте та виконуйте завдання" +
            " зі швидкістю та завдяки PCIe 5.0, до 32 потоків обробки та спеціальним відеоприскорювачам.\n" +
            "Створіть збірку, що змінить правила гри\n" +
            "Материнські плати AMD Socket AM5 надають нові функції для геймерів: від швидкості пам'яті DDR5 до збільшеної " +
            "пропускної здатності з PCIe 5.0. Збірка для процесорів AMD Ryzen 7000 серії і більш пізніх версій з процесором" +
            " AMD Socket AM5. Персоналізуйте продуктивність та задовільняйте свою потребу у швидкості, розганяючи процесор. " +
            " Розганяйте пам'ять DDR5 за допомогою технології AMD EXPO та отримуйте ще більше продуктивності. ",
        numberOfItems: 10
    },
    {
        id: 30,
        componentName: "AMD Ryzen 5 8600G",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/Q3q1XmQG/3.webp",
            "https://i.ibb.co/j9yrQ3HQ/2.webp",
            "https://i.ibb.co/gZNSkk91/1.webp",
        ],
        price: 142,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM5",
            processorFrequencyGHz: 4.3,
            numberOfCores: "6cores",
            numberOfThreads: "12threads",
            l3cacheMB: 16
        },
        description: "Процесор AMD Ryzen 5 8600G (100-100001237BOX) побудований на архітектурі з підтримкою " +
            "Socket AM5 і має 6 продуктивних ядер із 12 потоками. Базова частота процесора становить 4,3 ГГц, " +
            "а максимальна досягає 5 ГГц, що забезпечує ефективне виконання багатозадачних операцій. У процесорі " +
            "реалізовано підтримку двоканальної оперативної пам'яті DDR5 з частотою до 5200 МГц, що покращує взаємодію " +
            "з системою пам'яті. Кеш-пам'ять AMD Ryzen 5 8600G (100-100001237BOX) містить 6 МБ другого рівня і 16 МБ" +
            " третього рівня, що допомагає оптимізувати оброблення даних і прискорює роботу застосунків. Виробнича " +
            "технологія 4 нм дає змогу знизити енергоспоживання і тепловиділення, а базове TDP становить 65 Вт. " +
            "Інтегрована графіка AMD Radeon 760M забезпечує підтримку базових графічних завдань і роботи з мультимедіа" +
            " без необхідності використання дискретної відеокарти. AMD Ryzen 5 8600G (100-100001237BOX) підтримує " +
            "технології багатопотоковості та оснащений розблокованим множником, що дозволяє користувачам налаштовувати " +
            "параметри роботи процесора для досягнення максимальної продуктивності.",
        numberOfItems: 10
    },
    {
        id: 31,
        componentName: "AMD Ryzen 7 7800X3D",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/PG8xZQnn/3.webp",
            "https://i.ibb.co/dwkykw1R/2.webp",
            "https://i.ibb.co/DgVk2Lj6/1.webp",
        ],
        price: 162,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM5",
            processorFrequencyGHz: 4.2,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 96
        },
        description: "Найшвидший виграє\n" +
            "Цей найкращий у світі процесор для настільних ПК гарантує чудову продуктивність в іграх.\n" +
            "\n" +
            "Технологія AMD StoreMI\n" +
            "Простий і швидкий спосіб розширити сховище даних настільного ПК з процесором AMD Ryzen та" +
            " прискорити його роботу.\n" +
            "\n" +
            "Програма AMD Ryzen Master\n" +
            "Проста та потужна програма для розгону процесорів AMD Ryzen.\n" +
            "\n" +
            "AMD Ryzen VR-Ready Premium\n" +
            "Для користувачів, які хочуть отримати максимум задоволення від використання технології віртуальної " +
            "реальності, компанія AMD пропонує високопродуктивні процесори Ryzen VR-Ready Premium.",
        numberOfItems: 10
    },
    {
        id: 32,
        componentName: "AMD Ryzen 7 9800X3D",
        category: "processors",
        imgUrls: [
            "https://i.ibb.co/mFJ3wj7Y/3.webp",
            "https://i.ibb.co/KxkM2tbj/2.webp",
            "https://i.ibb.co/k6cg6WzQ/1.webp",
        ],
        price: 168,
        processorOptions: {
            producer: "AMD",
            processorSocket: "AM5",
            processorFrequencyGHz: 4.7,
            numberOfCores: "8cores",
            numberOfThreads: "16threads",
            l3cacheMB: 96
        },
        description: "Найшвидший виграє\n" +
            "Цей найкращий у світі процесор для настільних ПК гарантує чудову продуктивність в іграх.\n" +
            "\n" +
            "Технологія AMD StoreMI\n" +
            "Простий і швидкий спосіб розширити сховище даних настільного ПК з процесором AMD Ryzen та прискорити його роботу.\n" +
            "\n" +
            "Програма AMD Ryzen Master\n" +
            "Проста та потужна програма для розгону процесорів AMD Ryzen.\n" +
            "\n" +
            "AMD Ryzen VR-Ready Premium\n" +
            "Для користувачів, які хочуть отримати максимум задоволення від використання технології віртуальної реальності," +
            " компанія AMD пропонує високопродуктивні процесори Ryzen VR-Ready Premium.",
        numberOfItems: 10
    }
];
//# sourceMappingURL=processors.js.map